application/app/Repositories/TaskRepository.php

insert into `tasks` (`task_creatorid`, `task_projectid`, `task_milestoneid`, `task_clientid`, `task_date_due`, `task_title`, `task_description`, `task_client_visibility`, `task_billable`, `task_status`, `task_priority`, `task_position`, `task_leadid`, `task_private`, `task_departmentid`, `task_updated`, `task_created`) values (1, '1', '', 0, '2022-04-08', 'test by yanshhh', '', 'yes', 'yes', 'new', 'normal', 393216, '1', 0, '', '2022-04-12 10:38:26', '2022-04-12 10:38:26')
---

        //save and return id

        if ($task->save()) {

select * from `customfields` where `customfields_type` = 'tasks'
---
    public function applyCustomFields($task) {



        //custom fields

        $fields = \App\Models\CustomField::Where('customfields_type', 'tasks')->get();