application/app/Http/Controllers/Leads.php


            'stats' => $this->statsWidget(),

            'fields' => \App\Models\CustomField::Where('customfields_type', 'leads')->where('customfields_status', 'enabled')->get(),
---
select * from `customfields` where `customfields_type` = 'leads' and `customfields_status` = 'enabled'


            'progress' => $this->checklistProgress($checklists),

            'fields' => \App\Models\CustomField::Where('customfields_type', 'leads')->where('customfields_status', 'enabled')->get(),
---
select * from `customfields` where `customfields_type` = 'leads' and `customfields_status` = 'enabled'