application/app/Permissions/TaskPermissions.php

select * from `tasks` where `task_id` = '72' limit 1
---
    public function check($action = '', $task = '') {



        //VALIDATIOn

        if (!in_array($action, $this->permissionChecksArray())) {

            Log::error("the requested check is invalid", ['process' => '[permissions][task]', config('app.debug_ref'), 'function' => __function__, 'file' => basename(__FILE__), 'line' => __line__, 'path' => __file__, 'check' => $action ?? '']);

            return false;

        }



        //GET THE RESOURCE

        if (is_numeric($task)) {

            if (!$task = \App\Models\Task::Where('task_id', $task)->first()) {